{
    "name": "Adaire Blocks",
    "version": "1.2.2",
    "download_url": "https://github.com/helloadaire/Adaire-Blocks/releases/download/v1.2.2.alpha/adaire-blocks.1.2.2.alpha.zip",
    "sections": {
      "description": "Adaire Blocks is a premium collection of Gutenberg blocks built with GSAP, React, and obsessive attention to responsive detail. Create modal dialogs, hero sliders, testimonial layouts, industry grids, process timelines, and CTA sections without building custom patterns.\n\nNew in 1.2.2\n• Added Hero 1 Block (Free) - Responsive hero block with flexible layout controls\n• Added Info Grid Block (Free) - Beautiful info grid with hover-expandable items\n• Added Info Grid 2 Block (Free) - Advanced grid layout with customizable backgrounds\n• Added Image Composition Block (Free) - Collage-style image compositions\n• Added Info Grid 3 Block (Plus) - 2-row grid with three-column sub-section\n• Added Info Grid 4 Block (Plus) - 2x2 grid with configurable colors and typography\n• Added Case Studies Block (Plus) - Dynamic case studies grid with filtering\n• Added Video Carousel Block (Plus) - Draggable video carousel with smooth scrolling\n• Unified layout settings across all infogrid blocks with consistent responsive controls\n• Standardized breakpoint system (mobile, tablet, small-laptop, desktop, big-desktop) across all blocks\n• Enhanced Call to Action block with responsive padding and max-width controls matching infogrid blocks\n• Fixed visual outline issues in infogrid2 block for cleaner design\n• Improved layout consistency with unified container width and block padding controls",
      "changelog": "<h4>1.2.2</h4><ul><li>Added Hero 1 Block (Free) - Responsive hero block with flexible layout controls and responsive padding</li><li>Added Info Grid Block (Free) - Beautiful info grid with hover-expandable items featuring title, tagline, and description</li><li>Added Info Grid 2 Block (Free) - Advanced grid layout with customizable items, backgrounds, and overlay options</li><li>Added Image Composition Block (Free) - Create collage-style compositions of images in asymmetric grid layouts</li><li>Added Info Grid 3 Block (Plus) - Responsive 2-row grid block with three-column sub-section and background options</li><li>Added Info Grid 4 Block (Plus) - 2x2 grid block with configurable colors, typography, and background SVG icon support</li><li>Added Case Studies Block (Plus) - Dynamic case studies grid with GSAP FLIP animations, filtering by Industry and Capabilities</li><li>Added Video Carousel Block (Plus) - Draggable video carousel with custom drag cursor and smooth scrolling cards</li><li>Unified layout settings across infogrid, infogrid2, infogrid3, and infogrid4 blocks for consistent controls</li><li>Standardized responsive breakpoints (mobile, tablet, small-laptop, desktop, big-desktop) across all blocks</li><li>Added responsive padding and max-width controls to infogrid (free) and infogrid2 blocks</li><li>Enhanced Call to Action block with layout settings matching infogrid blocks (max-width and block padding)</li><li>Fixed black outline border issue in infogrid2 block for cleaner visual appearance</li><li>Updated all blocks to use consistent 5-breakpoint system aligned with hero1 block</li><li>Improved editor preview with real-time updates for layout settings</li><li>Updated validation server endpoint to adaireblocks.com for license management</li></ul><h4>1.2.1</h4><ul><li>Improved icon management system with unified mapping configuration for easier maintenance.</li><li>Fixed Progress Block icon path to use correct Plus tier icon.</li><li>Enhanced build scripts to use centralized icon mapping configuration.</li><li>Improved developer experience with editable icon mapping file.</li></ul><h4>1.2.0</h4><ul><li>Added Flip Card Block with interactive front/back content areas and smooth 3D transitions.</li><li>Added Pricing Table Block with monthly/yearly toggle and customizable cards.</li><li>Added Progress Block with scroll-based indicators in bar and ring variants.</li><li>Added Animation on Scroll Block with 12 animation types and live editor preview.</li><li>Added Social Share Block with customizable platform selection and tooltip interface.</li><li>Added Testimonial 3 Block with draggable interface and premium styling.</li><li>Enhanced block management interface with tier-based organization.</li><li>Updated all block icons with consistent SVG artwork.</li></ul>",
      "installation": "<ol><li>Upload the plugin files to the <code>/wp-content/plugins/adaire-blocks</code> directory or install via the WordPress admin.</li><li>Activate the plugin through the 'Plugins' menu.</li><li>Navigate to Adaire Blocks → Block Management to enable/disable blocks.</li><li>All blocks from previous versions remain available with improved layout consistency.</li></ol>",
      "screenshots": "<ol><li>Accordion Block</li><li>Call-to-Action Block</li><li>Animation on Scroll Block</li><li>Social Share Block</li></ol>"
    },
    "banners": {
      "high": "",
      "low": ""
    }
  }

